OF_PV_Column_Average/test_case/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        //type      zeroGradient;
    type            inletOutlet;
       inletValue      uniform 1;
        value           uniform 1;
    }


    outlet
    {
        type      zeroGradient;
    //type            inletOutlet;
        //inletValue      uniform 0;
       // value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
