OF_PV_Column_Average/test_case/0/epsilon
/*--------------------------------*xingLengthDissipationRateInlet;0.01271- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1656.714;

boundaryField
{
    

    inlet
    {
    //    type            inletOutlet;
    //    inletValue      uniform 77;
    //    value           uniform 77;
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000889;
        value           uniform 0.15; //placeholder
        //type                          zeroGradient;

    }

    outlet
    {
        // type            inletOutlet;
        // inletValue      uniform 30;
        // value           uniform 30;
        type                zeroGradient;
    }

    wall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 70;
    }

}


// ************************************************************************* //
