OF_PV_Column_Average/test_case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.424814;

boundaryField
{

    inlet
    {
       // type            inletOutlet;
       // inletValue      uniform 1;
       // value           uniform 1;
         type            turbulentIntensityKineticEnergyInlet;
         intensity       0.1;
     //    intensity       0.045408331;
         value           $internalField;

    }

    outlet
    {
        // type            inletOutlet;
        // inletValue      uniform 1.5;
        // value           uniform 1.5;
        type                zeroGradient;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
