OF_PV_Column_Average/test_case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0;

    }


    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutUSpaldingWallFunction;
        //Cmu             0.09;
        //kappa           0.41;
        //E               9.8;
        value   uniform 0;
        maxIter 100;
        tolerance 1e-7;    
    }


}


// ************************************************************************* //
