OF_PV_Column_Average/test_case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {	
    // type	zeroGradient;
//        type        fixedValue;
 //       value       uniform 494450;
        type fixedFluxPressure;
        value $internalField; 
    }

    outlet
    {
	type	totalPressure;
	p0	uniform 0;
    }

    wall
    {
        type            zeroGradient; //fixedFluxPressure;
        // //value           uniform 0;
      //  type fixedFluxPressure;
      //  value $internalField; 
    }

}

// ************************************************************************* //
