OF_PV_Column_Average/test_case/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType "Bfull"; // A or B

couplingInterval 10;

voidFractionModel divided;//centre;//

locateModel engine;//engineIB;//

meshMotionModel noMeshMotion;

IOModel basicIO;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dense;//dilute;//

clockModel off;//standardClock;//

smoothingModel constDiffSmoothing;// localPSizeDiffSmoothing;// constDiffSmoothing; //


useDDTvoidfraction;
forceModels
(
   GidaspowDrag
    //BeetstraDrag
    //DiFeliceDrag
    gradPForce
    viscForce
    //KochHillDrag
    //DEMbasedDrag
    //RongDrag
   Archimedes
    //volWeightedAverage
    //totalMomentumExchange
    //particleCellVolume
    //fieldTimeAverage
    fieldStore
    //fieldVolWeighted
//	checkCouplingInterval
//    surfaceTensionForce
    interface
);

momCoupleModels
(
    implicitCouple
);

//turbulenceModelType "RASProperties";//"LESProperties";//OFversion24x
turbulenceModelType turbulenceProperties;//"LESProperties";//OFversion30x

//===========================================================================//
// sub-model properties
interfaceProps
{
    VOFvoidfractionFieldName "alpha.water";
    gradAlphaName            "gradAlpha";
    alphaThreshold           0.55;
    sigma                    0.07;
    theta                    1.12;
    deltaAlphaIn             0.3;
    deltaAlphaOut            0.0;
    interpolation true;
    C 10;
}



localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-3;
    Csmoothing    1.0; 
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength 1.5e-3;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    treatForceDEM true;
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}
totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
}
GidaspowDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    interpolation true;
    phi 1;
}
DEMbasedDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    interpolation true;
}

KochHillDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    //forceSubModels
    //(
    //    ImExCorr
    //);
    implForceDEM true;
    //implForceDEMaccumulated true;
    //explicitCorr true;
}

BeetstraDragProps
{
    velFieldName "U";
    gravityFieldName "g";
    rhoParticle     2000.;
    voidfractionFieldName "voidfraction";
    interpolation true;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag ;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

RongDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    implForceDEM true;
    implForceDEMaccumulated true;
    granVelFieldName "Us";
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}

fieldVolWeightedProps
{
    startTime 0;

    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
    useVolumeFraction true;
    volumeFractionName "voidfraction";
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
    alphaMin 0.1;
}

"(engineProps|turboEngineProps|turboEngineM2MProps)"
{
    treeSearch true;
}

engineIBProps
{
    treeSearch true;
    zSplit 8;
    xySplit 16;
}

dividedProps
{
    alphaMin 0.1;
    scaleUpVol 1.0;
    //procBoundaryCorrection true;
}

"(twoWayMPIProps|M2MProps)"
{
    liggghtsPath "../DEM/in.liggghts_run";
}

checkCouplingIntervalProps
{

	rhoP 2.5;
	UmaxExpected 3000;
	timeInterval 100;
}
surfaceTensionForceProps
{
}

// ************************************************************************* //
