OF_PV_Column_Average/test_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0.38;

stopAt          endTime;

endTime         1.2;

deltaT          0.000005;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.1;
maxAlphaCo	0.1;

// libs (
//          "libOpenFOAM.so"
//          "libsimpleSwakFunctionObjects.so" 
//          "libswakFunctionObjects.so"
//      );

libs (
    "libgroovyBC.so"
    "libsimpleFunctionObjects.so"
    "libswakFunctionObjects.so"
    "libsimpleSwakFunctionObjects.so"
);


functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        restartOnRestart    false;
       // restartOnOutput     false;
       // periodicRestart     false;
       // restartPeriod       0.002;

        
        fields
        (

            U
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }

            Us
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }
            alpha.water
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }
            k
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
            }
        );
    }
}
// functions
// {
//     volFlow
//     {
//         type                swakExpression;
//         valueType           patch;
//         patchName           atmosphere;
        
//         verbose             true;
//         expression          "U&Sf()";
//         accumulations       ( sum );
// 	outputInterval	    500;
//     }
// }

// ************************************************************************* //
